---
kind: method
id: M:Autodesk.Revit.DB.STLExportOptions.#ctor
source: html/2498b8fd-e3fe-43d3-2b72-0ea04812d71d.htm
---
# Autodesk.Revit.DB.STLExportOptions.#ctor Method

Constructs a new instance of STLExportOptions with default values of all properties.

## Syntax (C#)
```csharp
public STLExportOptions()
```